app/controllers/publications_controller.rb

SELECT `publications`.* FROM `publications`
---
	def index
		@publications = Publication.all